x = int(input())
y = int(input())
z = int(input())


if x > y and x > y:
    print(x)
elif y > x and y > z:
    print(y)
elif z > x and z > y:
    print(z)


#Даны три целых числа. Найдите наибольшее из них (программа должна вывести ровно одно целое число).

#Какое наименьшее число операторов сравнения (>, <, >=, <=) необходимо для решения этой задачи?

#Формат ввода

#Вводится три целых числа.
